{
  "title": "Parcours",
  "company": {
    "type": "Entreprise",
    "activity": "Mission"
  },
  "school": {
    "type": "Ecole",
    "activity": "Cours"
  },
  "website": "Site Internet",
  "ed": {
    "date": "Depuis Janvier 2022",
    "company": "Energies Demain",
    "job": "Développeur web full-stack",
    "desc": "Accélérateur d’idées, conseil et acteur de terrain, Énergies Demain œuvre en faveur de la transition sociétale et écologique.Nous plaçons l’humain au cœur de notre projet d’entreprise.",
    "mission": {
      "desc": "Je travaille au sein de l'équipe développement web, pour concevoir et faire évoluer les outils web afin qu'ils répondent au mieux aux besoins de nos clients :",
      "ul1": "Implémentation de nouvelles fonctionnalités et refonte de l’interface de l’outil d’ERP ",
      "ul2": "Refactoring et modernisation du front-end de l’outil de cartographie et visualisation de données"
    },
    "website": "https://www.energies-demain.com"
  },
  "umi": {
    "date": "Juillet 2015 - Décembre 2021",
    "company": "United Motion Ideas",
    "job": "Ingénieur conception et développement",
    "desc": "UMI est l’outil de test marché dédié au succès de vos projets d’innovation. Nous boostons les interactions avec les acteurs de votre marché, parmi le milliard de professionnels atteignables grâce à nos algorithmes.",
    "mission": {
      "desc": "En tant que développeur web full-stack, j'ai contribué au développement de l'application, depuis son lancement public jusqu'à fin 2021, année durant laquelle nous avons réalisé plus de 200 missions pour nos clients.",
      "ul1": "amélioration du module de recherche de professionnels : ciblage plus pertinent, volumes plus élevés, évaluation de la pertinence de nos résultats",
      "ul2": "automatisation et optimisation du système d'envoi des emails",
      "ul3": "enrichissement et qualification de la base de données",
      "ul4": "montée en compétence sur le devops, et la CI/CD avec drone et rancher",
      "ul5": "amélioration continue du code et de l'architecture de l'application",
      "ul6": "encadrement et formation de stagiaires et développeur·euses juniors"
    },
    "website": "https://www.umi.us"
  },
  "umi2": {
    "date": "Août 2014 - Juin 2015",
    "company": "United Motion Ideas",
    "job": "Stage de fin d'études",
    "desc": "UMI est l’outil de test marché dédié au succès de vos projets d’innovation. Nous boostons les interactions avec les acteurs de votre marché, parmi le milliard de professionnels atteignables grâce à nos algorithmes.",
    "mission": {
      "desc": "Lors de ce stage, j'ai pris en charge la conception et le développement d'un module de recherche de professionnels ciblés",
      "ul1": "conception d'un microservice et de son API Rest",
      "ul2": "implémentation de tests unitaires",
      "ul3": "réalisation de l'interface utilisateurs permettant de lancer les recherches et visualiser les résultats",
      "ul4": "Conception et implémentation d'un système de notifications en temps réel pour notre application web",
      "ul5": "mise en place d'un système publish/subscribe avec redis",
      "ul6": "gestion des évènements en temps réel avec socket.io"
    },
  "website": "https://www.umi.us"
  },
  "mozilla": {
    "date": "Juin 2013",
    "company": "Mozilla Firefox",
    "job": "Projet de contribution au logiciel libre",
    "desc": "Mozilla Firefox est un navigateur web libre et gratuit, développé et distribué par la Mozilla Foundation, avec l'aide de nombreux contributeurs bénévoles.",
    "mission":  {
      "desc": "Dans une équipe de 4 étudiants sous la supervision d'un employé de la Mozilla Foundation, nous avons corrigés plusieurs bugs et implémenté de nouvelles fonctionnalités liées à la partie media du navigateur."
    },
    "website": "https://www.mozilla.org/fr/firefox/new/"
  },
  "stm": {
    "date": "Juillet 2012 - Août 2012",
    "company": "ST Microelectronics",
    "job": "Stage opérateur en salle blanche",
    "desc": "STMicroelectronics est une société internationale qui développe, fabrique et commercialise des puces électroniques. Elle est l'un des tout premiers acteurs mondiaux du secteur économique de la production de semi-conducteurs.",
    "mission":  {
      "desc": "Travail dans la salle blanche Crolles 300, sur la chaîne de production de wafers 300mm. En poste sur la \"speedline\": suivi des lots urgents de la production."
    },
    "website": "http://www.st.com/content/st_com/en/about/careers/st-locations/emea/france/crolles.html"
  },
  "upc": {
    "date": "2013 - 2014",
    "company": "FIB BarcelonaTech",
    "job": "Master in Informatics",
    "desc": "L'Université polytechnique de Catalogne (BarcelonaTech) est la plus grande université scientifique et technique de la Generalitat de Catalogne en Espagne. La Facultat d'Informàtica est le département dédié à l'informatique.",
    "mission":  {
      "desc": "En échange universitaire (Erasmus) durant deux semestres, j'ai suivi le cursus du Master in Innovation and Research in Informatics : cours de réseau, de programmation (Javascript, Erlang) mais aussi de Machine Learning."
    },
    "website": "http://www.fib.upc.edu/"
  },
  "imag": {
    "date": "2012 - 2013",
    "company": "Grenoble INP Ensimag",
    "job": "Deuxième année d’école d’ingénieurs",
    "desc": "L’École Nationale Supérieure d’Informatique et de Mathématiques Appliquées est une grande école d’ingénieurs du groupe Grenoble INP, spécialisée en informatique, mathématiques et télécommunications.",
    "mission":  {
      "desc": "J'ai pu appronfondir à l'ENSIMAG mes compétences en développement logiciel, sécurité des réseaux ou encore systèmes de gestion de base de données."
    },
    "website": "http://ensimag.grenoble-inp.fr/"
  },
  "phelma": {
    "date": "2011 - 2012",
    "company": "Grenoble INP Phelma",
    "job": "Première année d’école d’ingénieurs",
    "desc": "L’École nationale supérieure de PHysique ÉLectronique MAtériaux est une grande école d’ingénieurs du groupe Grenoble INP qui offre une grande diversité de cursus, des technologies de l'information à la nanotechnologie.",
    "mission":  {
      "desc": "Engagé dans le tronc commun PET (Physique, Électronique, Télécoms), j'ai suivi des cours portant sur des thèmes variés tels que l'électronique, la programmation en C ou encore le traitement du signal."
    },
    "website": "http://phelma.grenoble-inp.fr/"
  }
}
